//****************************************************************************
//****************************************************************************
//**                                                                        **
//**            (C)Copyright 1993-2017 Supermicro Computer, Inc.            **
//**                                                                        **
//****************************************************************************
//****************************************************************************
//
//  File History
//
//  Rev. 1.03
//    Bug Fix : N/A.
//    Reason  : Based on Purley_Setup_Mapping_Language_Draft_20170301_Joe.xlsx 
//              and Official_BIOS_SOP_Revised_Draft_20170301_Mapping_Language_Joe.xlsx 
//              to implement HII mapping language for BIOS setting preservation.
//    Auditor : Joe Jhang
//    Date    : Mar/02/2017
//
//  Rev. 1.02
//   Bug Fixed:  Modify "Memory corrected Error Enabling" to "Memory Corrected Error Enabling".
//   Reason:     
//   Auditor:    Hartmann Hsieh
//   Date:       Mar/15/2017
//
//  Rev. 1.01
//    Bug Fix:  Draft template v0.1.
//    Reason:   
//    Auditor:  Jimmy Chiu
//    Date:     Jan/20/2017
//
//  Rev. 1.00
//    Bug Fix:  Draft template.
//    Reason:   
//    Auditor:  Kasber Chen
//    Date:     Dec/16/2016
//
//****************************************************************************
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**             5555 Oakbrook Pkwy, Norcross, GA 30093               **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
//<AMI_FHDR_START>
//
// Name: ACPI.UNI
//
// Description: ACPI Form String Definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

#string STR_ACPI_FORM                   #language eng "ACPI Settings"

#string STR_ACPI_FORM_HELP              #language eng "System ACPI Parameters."

#string STR_ACPI_SLEEP_PROMPT           #language eng "ACPI Sleep State"
                                        #language x-AMI "ACPI001"

#string STR_ACPI_SLEEP_HELP             #language eng "Select the highest ACPI sleep state the system will enter when the SUSPEND button is pressed."

#string STR_ACPI_SLEEP_S1               #language eng "S1 (CPU Stop Clock)"

#string STR_ACPI_SLEEP_S3               #language eng "S3 (Suspend to RAM)"

#string STR_ACPI_SLEEP_NO               #language eng "Suspend Disabled"

#string STR_ACPI_S4_PROMPT              #language eng "Enable Hibernation"
                                        #language x-AMI "COMMN01D" //SMCPKG_SUPPORT

#string STR_ACPI_S4_HELP                #language eng "Enables or Disables System ability to Hibernate (OS/S4 Sleep State). This option may not be effective with some operating systems."

#string STR_ACPI_LOCK_LEGACY_DEV_PROMPT #language eng "Lock Legacy Resources"
                                        #language x-AMI "COMMN01E" //SMCPKG_SUPPORT

#string STR_ACPI_LOCK_LEGACY_DEV_HELP   #language eng "Enables or Disables Lock of Legacy Resources"

#string STR_ACPI_AUTO_PROMPT            #language eng "Enable ACPI Auto Configuration"
                                        #language x-AMI "ACPI004"

#string STR_ACPI_AUTO_HELP              #language eng "Enables or Disables BIOS ACPI Auto Configuration."

#string STR_S3_VIDEO_REPOST_PROMPT      #language eng "S3 Video Repost"
                                        #language x-AMI "ACPI005"

#string STR_S3_VIDEO_REPOST_HELP        #language eng "Enable or Disable S3 Video Repost"

#string STR_FORCE_TO_ACPI1_PROMPT       #language eng "Force to ACPI ver. 1.1"
                                        #language x-AMI "ACPI006"

#string STR_FORCE_TO_ACPI1_HELP         #language eng "Enable or Disable Generate only ACPI tables for version 1.1"

#string STR_ACPI_DISABLED               #language eng "Disabled"

#string STR_ACPI_ENABLED                #language eng "Enabled"

//SMCPKG_SUPPORT S
#string STR_NUMAEN                      #language eng "NUMA"
                                        #language x-AMI "CSPPL04E" //SMCPKG_SUPPORT
#string STR_NUMAEN_HELP                 #language eng "Enable or Disable Non uniform Memory Access (NUMA)."
#string STR_PCI_AER_PROMPT              #language eng "PCI AER Support"
#string STR_PCI_AER_HELP                #language eng "$SMCUNHIDE$Enable/Disable ACPI OS to natively manage PCI Advanced Error Reporting."
#string STR_MEM_COR_ERR_EN_PROMPT       #language eng "Memory Corrected Error Enabling" // SMCPKG_SUPPORT
#string STR_MEM_COR_ERR_EN_HELP         #language eng "$SMCUNHIDE$Enable/Disable Memory Corrected Error" 
#string STR_WHEA_SUPPORT_EN_PROMPT      #language en-US "WHEA Support"
                                        #language x-AMI "COMMN01B" //SMCPKG_SUPPORT
#string STR_WHEA_SUPPORT_EN_HELP        #language en-US "Enable/Disable WHEA support" 
#string STR_HPET_PROMPT                 #language en-US "High Precision Event Timer"
                                        #language x-AMI "COMMN01C" //SMCPKG_SUPPORT
#string STR_HPET_HELP                   #language en-US "Enable or Disable the High Precision Event Timer."
//SMCPKG_SUPPORT E
//#string <string name> #language eng ""

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**             5555 Oakbrook Pkwy, Norcross, GA 30093               **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************